In [2]:
import pandas as pd
import numpy as np
import sklearn
from sklearn.linear_model import LogisticRegression

In [3]:
train_df = pd.read_csv(r'training.csv',encoding = 'utf-8')
test_df = pd.read_csv(r'testing.csv',encoding = 'utf-8')

In [4]:
train_df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,NaN,Q,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,S,0
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q,1

In [5]:
test_df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S
...,...,...,...,...,...,...,...,...,...,...
218,3,"Lindqvist, Mr. Eino William",male,20.0,1,0,STON/O 2. 3101285,7.9250,NaN,S
219,1,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.5500,B38,S
220,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
221,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.4500,NaN,S
222,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S

In [6]:
# Logistic Regression only works on numerical data, so dropping columns with text fields
# Columns like "Name" , "Ticket", "Cabin" must not have any significant impact on data classification
df = pd.concat([train_df,test_df])

In [7]:
df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1.0
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0.0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0.0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0.0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...
218,3,"Lindqvist, Mr. Eino William",male,20.0,1,0,STON/O 2. 3101285,7.925,NaN,S,NaN
219,1,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.550,B38,S,NaN
220,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.900,C65,C,NaN
221,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.450,NaN,S,NaN
222,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.000,F2,S,NaN

In [8]:
df.isnull().any()

Pclass      False
Name        False
Sex         False
Age          True
SibSp       False
Parch       False
Ticket      False
Fare        False
Cabin        True
Embarked     True
Survived     True
dtype: bool

In [9]:
# Age, Embarked, Cabin have missing values
# Assuming Cabin has no role in classification
df.drop(columns=['Ticket','Cabin','Name'],inplace=True)

In [10]:
df['Survived'].isnull().sum()

223

In [11]:
df['Embarked'].fillna('S',inplace=True)

In [12]:
df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [13]:
# replace missing values in age with median ages of males and females respectively
male_age = df.groupby('Sex').median()['Age'].loc['male']
female_age = df.groupby('Sex').median()['Age'].loc['female']
print(male_age)
print(female_age)

29.0
27.0

In [14]:
filt_m = ((df['Age'].isna()) & (df['Sex'] == 'male'))
filt_f = ((df['Age'].isna()) & (df['Sex'] == 'female'))

In [15]:
df.loc[filt_m,'Age'] = male_age
df.loc[filt_f,'Age'] = female_age

In [16]:
# One hot encoding for Sex and Embarked Columns
embark = pd.get_dummies(df['Embarked'],prefix='Embarked')
sex = pd.get_dummies(df['Sex'],prefix='gender')

In [17]:
sex.isnull()

     gender_female  gender_male
0            False        False
1            False        False
2            False        False
3            False        False
4            False        False
..             ...          ...
218          False        False
219          False        False
220          False        False
221          False        False
222          False        False

[891 rows x 2 columns]

In [18]:
df = pd.concat([df,sex],axis=1)

In [19]:
df = pd.concat([df,embark],axis=1)

In [20]:
df.drop(columns=['Embarked','Sex'],inplace=True)

In [21]:
cols = list(df.columns)

In [22]:
labels = cols[5]
cols = cols[0:5] + cols[6:]
cols.append(labels)

In [23]:
df = df[cols]

In [24]:
df

,Pclass,Age,SibSp,Parch,Fare,gender_female,gender_male,Embarked_C,Embarked_Q,Embarked_S,Survived
0,2,29.0,1,0,26.000,1,0,0,0,1,1.0
1,3,29.0,0,0,8.050,0,1,0,0,1,0.0
2,2,39.0,0,0,26.000,0,1,0,0,1,0.0
3,3,29.0,0,4,21.075,1,0,0,0,1,0.0
4,3,25.0,0,0,7.050,0,1,0,0,1,0.0
...,...,...,...,...,...,...,...,...,...,...,...
218,3,20.0,1,0,7.925,0,1,0,0,1,NaN
219,1,45.0,0,0,26.550,0,1,0,0,1,NaN
220,1,17.0,1,0,108.900,1,0,1,0,0,NaN
221,3,43.0,0,0,6.450,0,1,0,0,1,NaN
222,2,36.5,0,2,26.000,0,1,0,0,1,NaN

In [25]:
test_filter = df['Survived'].isnull()
test_df = df.loc[test_filter]
train_df = df.loc[~test_filter]

In [26]:
train_df

,Pclass,Age,SibSp,Parch,Fare,gender_female,gender_male,Embarked_C,Embarked_Q,Embarked_S,Survived
0,2,29.0,1,0,26.0000,1,0,0,0,1,1.0
1,3,29.0,0,0,8.0500,0,1,0,0,1,0.0
2,2,39.0,0,0,26.0000,0,1,0,0,1,0.0
3,3,29.0,0,4,21.0750,1,0,0,0,1,0.0
4,3,25.0,0,0,7.0500,0,1,0,0,1,0.0
...,...,...,...,...,...,...,...,...,...,...,...
663,2,17.0,0,0,10.5000,1,0,0,0,1,1.0
664,3,29.0,0,0,7.7500,0,1,0,1,0,0.0
665,3,32.0,0,0,56.4958,0,1,0,0,1,1.0
666,3,22.0,0,0,9.8375,1,0,0,0,1,0.0
667,3,27.0,1,0,15.5000,1,0,0,1,0,1.0

In [27]:
test_df

,Pclass,Age,SibSp,Parch,Fare,gender_female,gender_male,Embarked_C,Embarked_Q,Embarked_S,Survived
0,2,8.0,1,1,36.7500,0,1,0,0,1,NaN
1,1,49.0,0,0,25.9292,1,0,0,0,1,NaN
2,3,29.0,0,0,7.7375,0,1,0,1,0,NaN
3,2,24.0,2,1,27.0000,1,0,0,0,1,NaN
4,1,36.0,0,0,26.2875,0,1,0,0,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...
218,3,20.0,1,0,7.9250,0,1,0,0,1,NaN
219,1,45.0,0,0,26.5500,0,1,0,0,1,NaN
220,1,17.0,1,0,108.9000,1,0,1,0,0,NaN
221,3,43.0,0,0,6.4500,0,1,0,0,1,NaN
222,2,36.5,0,2,26.0000,0,1,0,0,1,NaN

In [28]:
classifier = LogisticRegression(solver='liblinear',max_iter=10000,C=0.3)

In [29]:
# get train data and labels in separate np arrays
X_train = train_df.iloc[:,:-1].to_numpy()

In [30]:
y_train = train_df.iloc[:,-1]

In [31]:
classifier.fit(X_train,y_train)

LogisticRegression(C=0.3, max_iter=10000, solver='liblinear')

In [32]:
test_df

,Pclass,Age,SibSp,Parch,Fare,gender_female,gender_male,Embarked_C,Embarked_Q,Embarked_S,Survived
0,2,8.0,1,1,36.7500,0,1,0,0,1,NaN
1,1,49.0,0,0,25.9292,1,0,0,0,1,NaN
2,3,29.0,0,0,7.7375,0,1,0,1,0,NaN
3,2,24.0,2,1,27.0000,1,0,0,0,1,NaN
4,1,36.0,0,0,26.2875,0,1,0,0,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...
218,3,20.0,1,0,7.9250,0,1,0,0,1,NaN
219,1,45.0,0,0,26.5500,0,1,0,0,1,NaN
220,1,17.0,1,0,108.9000,1,0,1,0,0,NaN
221,3,43.0,0,0,6.4500,0,1,0,0,1,NaN
222,2,36.5,0,2,26.0000,0,1,0,0,1,NaN

In [33]:
X_test = test_df.iloc[:,:-1].to_numpy()

In [34]:
X_test.shape

(223, 10)

In [35]:
classifier.score(X_train,y_train)

0.7949101796407185

In [36]:
classifier.predict_proba(X_test)

array([[0.70629586, 0.29370414],
       [0.17705968, 0.82294032],
       [0.85456266, 0.14543734],
       [0.31163489, 0.68836511],
       [0.62769146, 0.37230854],
       [0.7280039 , 0.2719961 ],
       [0.82007409, 0.17992591],
       [0.85457036, 0.14542964],
       [0.30802452, 0.69197548],
       [0.86355489, 0.13644511],
       [0.23547446, 0.76452554],
       [0.86400184, 0.13599816],
       [0.0607265 , 0.9392735 ],
       [0.33504679, 0.66495321],
       [0.7423255 , 0.2576745 ],
       [0.76746295, 0.23253705],
       [0.83845838, 0.16154162],
       [0.83336318, 0.16663682],
       [0.8424082 , 0.1575918 ],
       [0.29252208, 0.70747792],
       [0.38283653, 0.61716347],
       [0.86360769, 0.13639231],
       [0.21163961, 0.78836039],
       [0.24683913, 0.75316087],
       [0.86437736, 0.13562264],
       [0.57557305, 0.42442695],
       [0.7513987 , 0.2486013 ],
       [0.69253183, 0.30746817],
       [0.28408589, 0.71591411],
       [0.32519258, 0.67480742],
       [0.72492658, 0.27507342],
       [0.98107819, 0.01892181],
       [0.85504508, 0.14495492],
       [0.77240826, 0.22759174],
       [0.87556254, 0.12443746],
       [0.1672047 , 0.8327953 ],
       [0.25011284, 0.74988716],
       [0.67482524, 0.32517476],
       [0.86107006, 0.13892994],
       [0.68998796, 0.31001204],
       [0.33990478, 0.66009522],
       [0.8421614 , 0.1578386 ],
       [0.72738952, 0.27261048],
       [0.86110467, 0.13889533],
       [0.32668426, 0.67331574],
       [0.42909199, 0.57090801],
       [0.90925933, 0.09074067],
       [0.33976117, 0.66023883],
       [0.74900493, 0.25099507],
       [0.8052825 , 0.1947175 ],
       [0.85455497, 0.14544503],
       [0.29654036, 0.70345964],
       [0.25134242, 0.74865758],
       [0.13960551, 0.86039449],
       [0.8834434 , 0.1165566 ],
       [0.90772736, 0.09227264],
       [0.72520959, 0.27479041],
       [0.87791555, 0.12208445],
       [0.84417528, 0.15582472],
       [0.86188889, 0.13811111],
       [0.82432546, 0.17567454],
       [0.66371569, 0.33628431],
       [0.12737429, 0.87262571],
       [0.34003907, 0.65996093],
       [0.22207507, 0.77792493],
       [0.91437457, 0.08562543],
       [0.88670512, 0.11329488],
       [0.49659456, 0.50340544],
       [0.09788263, 0.90211737],
       [0.70311078, 0.29688922],
       [0.83599448, 0.16400552],
       [0.86401395, 0.13598605],
       [0.55487864, 0.44512136],
       [0.86307504, 0.13692496],
       [0.87229693, 0.12770307],
       [0.05885016, 0.94114984],
       [0.30612125, 0.69387875],
       [0.76028005, 0.23971995],
       [0.70396705, 0.29603295],
       [0.91657592, 0.08342408],
       [0.73491348, 0.26508652],
       [0.11420458, 0.88579542],
       [0.92976893, 0.07023107],
       [0.75320395, 0.24679605],
       [0.85214466, 0.14785534],
       [0.26197159, 0.73802841],
       [0.50707579, 0.49292421],
       [0.4527381 , 0.5472619 ],
       [0.84222724, 0.15777276],
       [0.86400184, 0.13599816],
       [0.35804618, 0.64195382],
       [0.92476401, 0.07523599],
       [0.86973934, 0.13026066],
       [0.34641475, 0.65358525],
       [0.85456777, 0.14543223],
       [0.76301807, 0.23698193],
       [0.90486015, 0.09513985],
       [0.63128036, 0.36871964],
       [0.91243441, 0.08756559],
       [0.05743828, 0.94256172],
       [0.33990478, 0.66009522],
       [0.86306526, 0.13693474],
       [0.08098949, 0.91901051],
       [0.94318259, 0.05681741],
       [0.17083197, 0.82916803],
       [0.04852046, 0.95147954],
       [0.87490153, 0.12509847],
       [0.85082931, 0.14917069],
       [0.98107819, 0.01892181],
       [0.84205982, 0.15794018],
       [0.82855018, 0.17144982],
       [0.14260258, 0.85739742],
       [0.2758054 , 0.7241946 ],
       [0.67967906, 0.32032094],
       [0.40523394, 0.59476606],
       [0.8180146 , 0.1819854 ],
       [0.83783929, 0.16216071],
       [0.33990478, 0.66009522],
       [0.90490821, 0.09509179],
       [0.86400184, 0.13599816],
       [0.87490503, 0.12509497],
       [0.86400184, 0.13599816],
       [0.87536662, 0.12463338],
       [0.84458506, 0.15541494],
       [0.50762253, 0.49237747],
       [0.9041295 , 0.0958705 ],
       [0.91042008, 0.08957992],
       [0.76301807, 0.23698193],
       [0.94706073, 0.05293927],
       [0.57496779, 0.42503221],
       [0.90000134, 0.09999866],
       [0.8348962 , 0.1651038 ],
       [0.8399254 , 0.1600746 ],
       [0.83736021, 0.16263979],
       [0.76920517, 0.23079483],
       [0.86434105, 0.13565895],
       [0.39301154, 0.60698846],
       [0.58161288, 0.41838712],
       [0.30831943, 0.69168057],
       [0.66900728, 0.33099272],
       [0.82589351, 0.17410649],
       [0.85497598, 0.14502402],
       [0.60647752, 0.39352248],
       [0.86401487, 0.13598513],
       [0.82798265, 0.17201735],
       [0.84765397, 0.15234603],
       [0.83185536, 0.16814464],
       [0.78255545, 0.21744455],
       [0.33986309, 0.66013691],
       [0.14085598, 0.85914402],
       [0.01004369, 0.98995631],
       [0.70717105, 0.29282895],
       [0.54608967, 0.45391033],
       [0.8487411 , 0.1512589 ],
       [0.23925054, 0.76074946],
       [0.82409056, 0.17590944],
       [0.72343883, 0.27656117],
       [0.26084171, 0.73915829],
       [0.8317803 , 0.1682197 ],
       [0.83489561, 0.16510439],
       [0.86391205, 0.13608795],
       [0.18890224, 0.81109776],
       [0.33756863, 0.66243137],
       [0.33990478, 0.66009522],
       [0.09074504, 0.90925496],
       [0.83884661, 0.16115339],
       [0.56659303, 0.43340697],
       [0.86407215, 0.13592785],
       [0.33426458, 0.66573542],
       [0.40169426, 0.59830574],
       [0.21598826, 0.78401174],
       [0.41942326, 0.58057674],
       [0.35761926, 0.64238074],
       [0.66003238, 0.33996762],
       [0.093925  , 0.906075  ],
       [0.84266835, 0.15733165],
       [0.88511469, 0.11488531],
       [0.82432546, 0.17567454],
       [0.88077927, 0.11922073],
       [0.24207578, 0.75792422],
       [0.8580956 , 0.1419044 ],
       [0.82589351, 0.17410649],
       [0.94045044, 0.05954956],
       [0.3438747 , 0.6561253 ],
       [0.27983562, 0.72016438],
       [0.89585133, 0.10414867],
       [0.37995602, 0.62004398],
       [0.72376691, 0.27623309],
       [0.08747175, 0.91252825],
       [0.87253818, 0.12746182],
       [0.83408651, 0.16591349],
       [0.86572627, 0.13427373],
       [0.17733711, 0.82266289],
       [0.86391205, 0.13608795],
       [0.8882844 , 0.1117156 ],
       [0.35191189, 0.64808811],
       [0.06411615, 0.93588385],
       [0.41468929, 0.58531071],
       [0.2520146 , 0.7479854 ],
       [0.09661436, 0.90338564],
       [0.85455497, 0.14544503],
       [0.52654083, 0.47345917],
       [0.84258623, 0.15741377],
       [0.67614028, 0.32385972],
       [0.85455497, 0.14544503],
       [0.88661022, 0.11338978],
       [0.8432952 , 0.1567048 ],
       [0.85497089, 0.14502911],
       [0.18540541, 0.81459459],
       [0.48354607, 0.51645393],
       [0.88288882, 0.11711118],
       [0.32967907, 0.67032093],
       [0.73475817, 0.26524183],
       [0.72615342, 0.27384658],
       [0.28710262, 0.71289738],
       [0.19916513, 0.80083487],
       [0.83830452, 0.16169548],
       [0.86391205, 0.13608795],
       [0.86896414, 0.13103586],
       [0.67818153, 0.32181847],
       [0.05878136, 0.94121864],
       [0.9007125 , 0.0992875 ],
       [0.81854741, 0.18145259]])

In [37]:
classifier.predict(X_test)

array([0., 1., 0., 1., 0., 0., 0., 0., 1., 0., 1., 0., 1., 1., 0., 0., 0.,
       0., 0., 1., 1., 0., 1., 1., 0., 0., 0., 0., 1., 1., 0., 0., 0., 0.,
       0., 1., 1., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1., 0., 0., 0.,
       1., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0., 1.,
       1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0.,
       1., 0., 1., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0., 1., 1., 0.,
       1., 0., 1., 1., 0., 0., 0., 0., 0., 1., 1., 0., 1., 0., 0., 1., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       1., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0.,
       0., 1., 0., 0., 1., 0., 0., 0., 1., 1., 1., 1., 0., 0., 0., 1., 1.,
       1., 1., 1., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1.,
       0., 1., 0., 0., 0., 1., 0., 0., 1., 1., 1., 1., 1., 0., 0., 0., 0.,
       0., 0., 0., 0., 1., 1., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 1.,
       0., 0.])

In [38]:
predictions = classifier.predict(X_test)

In [39]:
predictions.shape

(223,)

In [348]:
np.savetxt('predictions_LReg.csv', predictions, delimiter = ',', fmt = '%.0f')